Documents/абс_СводнаяЗаявкаНаТранспорт/абс_СводнаяЗаявкаНаТранспорт.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>абс_СводнаяЗаявкаНаТранспорт</name>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИсполнения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Маршруты</name>
    <attributes>
      <name>ТранспортныйМаршрут</name>
      <type>
        <types>DocumentRef.абс_ТранспортныйМаршрут</types>
      </type>
    </attributes>
    <attributes>
      <name>ЗаявкаНаТранспорт</name>
      <type>
        <types>DocumentRef.абс_ЗаявкаНаТранспорт</types>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Documents/абс_ТранспортныйМаршрут/абс_ТранспортныйМаршрут.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>абс_ТранспортныйМаршрут</name>
  <attributes>
    <name>СводнаяЗаявкаНаТранспорт</name>
    <type>
      <types>DocumentRef.абс_СводнаяЗаявкаНаТранспорт</types>
    </type>
  </attributes>
  <attributes>
    <name>ТранспортноеСредство</name>
    <type>
      <types>CatalogRef.абс_ТранспортныеСредства</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ТКПеревозчик</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ВодительЭкспедитор</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерПломбы</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.абс_СтатусыЗаявокНаТранспорт</types>
    </type>
  </attributes>
  <attributes>
    <name>ПоручениеЭкспедитору</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>СерияПутевогоЛиста</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерПутевогоЛиста</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаЗакрытияТранспортногоМаршрута</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Задания</name>
    <attributes>
      <name>ЗаявкаНаТранспорт</name>
      <type>
        <types>DocumentRef.абс_ЗаявкаНаТранспорт</types>
      </type>
    </attributes>
    <attributes>
      <name>ФормироватьДоверенность</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Доверенность</name>
      <type>
        <types>DocumentRef.Доверенность</types>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ФактДатаОкончания</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаДоставки</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Documents/абс_СводнаяЗаявкаНаТранспорт/ObjectModule.bsl
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	Ответственный = ПараметрыСеанса.ТекущийПользователь;
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	Ответственный = ПараметрыСеанса.ТекущийПользователь;
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	ПроверитьЗаполнениеДокумента(Отказ);
	
КонецПроцедуры

Процедура ПроверитьЗаполнениеДокумента(Отказ)
	
	Для каждого СтрокаТЧ из Маршруты Цикл
		Если Не ЗначениеЗаполнено(СтрокаТЧ.ТранспортныйМаршрут) Тогда
			ОбщегоНазначения.СообщитьОбОшибке("В строке "+СтрокаТЧ.НомерСтроки+" не указан транспортный маршрут");
			Отказ = Истина;
		КонецЕсли;
		Если Не ЗначениеЗаполнено(СтрокаТЧ.ЗаявкаНаТранспорт) Тогда
			ОбщегоНазначения.СообщитьОбОшибке("В строке "+СтрокаТЧ.НомерСтроки+" не указана заявка на транспорт");
			Отказ = Истина;
		КонецЕсли;
	КонецЦикла;
		
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	ЗаполнитьТранспортныеМаршруты(Отказ);	
	
КонецПроцедуры

//Процедура проверяет табличные части документов Транспортный маршрут,
//если в Сводной заявке для Транспортного маршрута добавились Заявки на транспорт
//эти заявки добавляются в соответствующие Транспортные маршруты 
Процедура ЗаполнитьТранспортныеМаршруты(Отказ = Ложь)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	абс_СводнаяЗаявкаНаТранспортМаршруты.ТранспортныйМаршрут,
	|	абс_СводнаяЗаявкаНаТранспортМаршруты.ЗаявкаНаТранспорт,
	|	абс_ТранспортныйМаршрутЗадания.ЗаявкаНаТранспорт КАК ЗаявкаИзМаршрута
	|ПОМЕСТИТЬ Маршруты
	|ИЗ
	|	Документ.абс_СводнаяЗаявкаНаТранспорт.Маршруты КАК абс_СводнаяЗаявкаНаТранспортМаршруты
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.абс_ТранспортныйМаршрут.Задания КАК абс_ТранспортныйМаршрутЗадания
	|		ПО абс_СводнаяЗаявкаНаТранспортМаршруты.ТранспортныйМаршрут = абс_ТранспортныйМаршрутЗадания.Ссылка
	|			И абс_СводнаяЗаявкаНаТранспортМаршруты.ЗаявкаНаТранспорт = абс_ТранспортныйМаршрутЗадания.ЗаявкаНаТранспорт
	|ГДЕ
	|	абс_СводнаяЗаявкаНаТранспортМаршруты.Ссылка = &Ссылка
	|	И НЕ абс_СводнаяЗаявкаНаТранспортМаршруты.ТранспортныйМаршрут = ЗНАЧЕНИЕ(Документ.абс_ТранспортныйМаршрут.ПустаяСсылка)
	|	И НЕ абс_СводнаяЗаявкаНаТранспортМаршруты.ЗаявкаНаТранспорт = ЗНАЧЕНИЕ(Документ.абс_ЗаявкаНаТранспорт.ПустаяСсылка)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Маршруты.ТранспортныйМаршрут КАК ТранспортныйМаршрут,
	|	Маршруты.ЗаявкаНаТранспорт КАК ЗаявкаНаТранспорт
	|ИЗ
	|	Маршруты КАК Маршруты
	|ГДЕ
	|	Маршруты.ЗаявкаИзМаршрута ЕСТЬ NULL 
	|ИТОГИ ПО
	|	ТранспортныйМаршрут,
	|	ЗаявкаНаТранспорт";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	ВыборкаМаршрут = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыборкаМаршрут.Следующий() Цикл
		
		ТранспортныйМаршрут = ВыборкаМаршрут.ТранспортныйМаршрут.ПолучитьОбъект();
		
		ВыборкаЗаявка = ВыборкаМаршрут.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока ВыборкаЗаявка.Следующий() Цикл
			НоваяСтрока = ТранспортныйМаршрут.Задания.Добавить();
			НоваяСтрока.ЗаявкаНаТранспорт = ВыборкаЗаявка.ЗаявкаНаТранспорт;
		КонецЦикла;
		
		Попытка
			ТранспортныйМаршрут.Записать(РежимЗаписиДокумента.Запись);
		Исключение
			Отказ = Истина;
		КонецПопытки;
		
	КонецЦикла;
	
КонецПроцедуры
